# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rake db:seed (or created alongside the db with db:setup).
#
# Examples:
#
#   cities = City.create([{ name: 'Chicago' }, { name: 'Copenhagen' }])
#   Mayor.create(name: 'Emanuel', city: cities.first)
require 'faker'

puts 'DESTROY ALL'
User.destroy_all
puts 'Create Static Page'
StaticPage.destroy_all

user = CreateAdminService.new.call
puts 'CREATED ADMIN USER: ' << user.email
# Environment variables (ENV['...']) can be set in the file config/application.yml.
# See http://railsapps.github.io/rails-environment-variables.html

StaticPage.create(
    vision_title_uk: 'Прогресивне сучасне тепле місто з теплими людьми',
    vision_title_en: 'Прогресивне сучасне тепле місто з теплими людьми',
    vision_text_uk: 'Тепле ставлення, теплі кав’ярні, теплі люди, теплі відносини, мініатюрність як перевага. Тут з’являється відчуття, що не все придбаєш за гроші, відчуття, що доторкаєшся до глибинних цінностей через простих людей, які тебе оточують. І це створює разючу відмінність від «корпоративної культури» великих міст. Теплий також означає натуральний та природній, без штучності. Відсутність штучності проявляється в усьому: матеріалах, їжі, природі, стосунках. Теплий означає мати «свій шлях». Це не намагання наздоганяти сучасні тренди, а пошук своєї сутності і демонстрація її з кращої сильної сторони. Якщо мова йде про конкуренцію, то люди і бізнеси змагаються лише в тому, хто більше згенерує тепла.',
    vision_text_en: 'Тепле ставлення, теплі кав’ярні, теплі люди, теплі відносини, мініатюрність як перевага. Тут з’являється відчуття, що не все придбаєш за гроші, відчуття, що доторкаєшся до глибинних цінностей через простих людей, які тебе оточують. І це створює разючу відмінність від «корпоративної культури» великих міст. Теплий також означає натуральний та природній, без штучності. Відсутність штучності проявляється в усьому: матеріалах, їжі, природі, стосунках. Теплий означає мати «свій шлях». Це не намагання наздоганяти сучасні тренди, а пошук своєї сутності і демонстрація її з кращої сильної сторони. Якщо мова йде про конкуренцію, то люди і бізнеси змагаються лише в тому, хто більше згенерує тепла.',
    values_text_uk: '<ul>
            <li>безкомпромісна якість (виключно світовий рівень)</li>
            <li>відкритість (просто, прозоро, зрозуміло)</li>
            <li>органічність (ніякої штучності ні в чому)</li>
            <li>індивідуальність (ми робимо унікальні речі)</li>
            <li>все, що ми робимо, генерує тепло</li>
        </ul>',
    values_text_en: '<ul>
            <li>безкомпромісна якість (виключно світовий рівень)</li>
            <li>відкритість (просто, прозоро, зрозуміло)</li>
            <li>органічність (ніякої штучності ні в чому)</li>
            <li>індивідуальність (ми робимо унікальні речі)</li>
            <li>все, що ми робимо, генерує тепло</li>
        </ul>',
    tasks_text_uk: '<ul>
            <li>об’єднання позитивних людей, бізнесів та ініціатив в місті заради збільшення ефекту їх діяльності</li>
            <li>обмін думками, ідеями, досвідом, натхненням</li>
            <li>генерування і реалізація нових проектів</li>
            <li>підвищення привабливості міста для жителів, гостей, кращих кадрів</li>
            <li>створення простору для реалізації активної молоді</li>
            <li>економічне зростання проектів, залучених в ТМ і міста в цілому</li>
            <li>формування свого унікального стилю міста</li>
        </ul>',
    tasks_text_en: '<ul>
            <li>об’єднання позитивних людей, бізнесів та ініціатив в місті заради збільшення ефекту їх діяльності</li>
            <li>обмін думками, ідеями, досвідом, натхненням</li>
            <li>генерування і реалізація нових проектів</li>
            <li>підвищення привабливості міста для жителів, гостей, кращих кадрів</li>
            <li>створення простору для реалізації активної молоді</li>
            <li>економічне зростання проектів, залучених в ТМ і міста в цілому</li>
            <li>формування свого унікального стилю міста</li>
        </ul>'
)
